app/controllers/posts_controller.rb

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO `posts` (`created_at`, `body`, `updated_at`) VALUES('2010-07-27 23:04:40', 'Hey guys, this week we had a tournament and we didn\'t win a single game!!!', '2010-07-27 23:04:40')